tools/tmux.org
#+TITLE: Tmux Notes
#+AUTHOR: Zhao Wenbin

* Concept

Tmux server manage session in background which can be attached by tmux
client.

A *session* is a single collection of pseudo terminals under the
management of tmux.

Each session has one or more window linked to it. A window occupies
the entire screen and may be split into rectangle *pane*.

Any number of tmux instances may connect to the same sessions. (Share
windows by multiple tmux client)

** TODO Clients and Sessions

** TODO Windows and Panes


* Shortcut

Prefix key is =Ctrl-b= by default, can be customed.

** Session

- =$= :: name session
- =s= :: list session
- =d= :: detach session

** Window

- =c= :: create window
- =&= :: kill window
- =f= :: find window
- =p= :: previous window
- =l= :: previous selected window
- =n= :: next window
- =w= :: list window
- [0-9] :: select window
- =,= :: name window

** Pane

- =%= :: vertial split
- ="= :: horizational split
- =o= :: swap pane
- =q= :: show pane identity
- =x= :: kill pane
- =;= :: previous pane
- arrow-key :: switch pane
- <c-dir> / <m-dir> :: resize pane
- <m-[1-5]> :: switch layout

** Misc

- =:= :: command prompt
- =t= :: show time

* Command

| command                   | description      |
|---------------------------+------------------|
| ~resize-pane -U/-D/-L/-R~ | adjust pane size |
| source-file theme-file    | load theme file  |

* Shell subcommand

- =tmux kill-session -t <session>=
- =tmux at -t <session>=
- =tmux at #=: attach the latest session

* TODO Configuration

** TODO Commands

** TODO Key Binding


* TODO Practice Tips
